softrider70/katzenbrunnen/sdkconfig.defaults
# ESP32-S3 (Dual-core, 512KB SRAM, PSRAM, dual USB)
# This file extends sdkconfig.defaults with ESP32-S3-specific settings

CONFIG_IDF_TARGET="esp32s3"

# ESP32-S3 has dual cores, no need for FREERTOS_NO_AFFINITY
CONFIG_FREERTOS_UNICORE=n

# S3 8MB PSRAM (Octal/OPI). Memtest aus, da er den fruehen Boot blockierte.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y
# CONFIG_SPIRAM_MEMTEST is not set
CONFIG_SPIRAM_IGNORE_NOTFOUND=y

# S3-specific performance
CONFIG_ESP32S3_DEFAULT_CPU_FREQ_160=y

# N16R8 Modul: 16MB Quad-Flash (QIO). Korrektes MSPI-Timing fuer Octal-PSRAM.
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

# Eigene Partitionstabelle (OTA-Layout fuer 16MB) verwenden
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# Console: COM5 ist ein CH343 USB-UART-Bridge an UART0 -> UART-Console verwenden
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
# CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG is not set
# CONFIG_ESP_CONSOLE_USB_CDC is not set
